; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v7 - type_2 ?v4 - type_1)
 	      (pred_2 ?v3 - object ?v4 - type_1)
	      (pred_4 ?v7 - type_2 ?v2 - type_3)
	      (pred_1 ?v7 - type_2 ?v3 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v8 ?v6 - type_1)
       :precondition (and  (pred_3 ?v7 ?v8))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_2 ?v5 - object ?v1 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v1) (pred_3 ?v7 ?v1) (pred_4 ?v7 ?v2))
       :effect (and (pred_1 ?v7 ?v5 ?v2)
		    (not (pred_2 ?v5 ?v1)) 
		    (not (pred_4 ?v7 ?v2))))

   (:action op_2
       :parameters (?v7 - type_2 ?v5 - object ?v1 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v5 ?v2) (pred_3 ?v7 ?v1))
       :effect (and (pred_2 ?v5 ?v1)
		    (pred_4 ?v7 ?v2)
		    (not (pred_1 ?v7 ?v5 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_06 obj_01 - type_3
obj_02 obj_07 obj_03 - type_1
obj_05 obj_09 obj_08 - object)
(:init
(pred_3 obj_04 obj_03)
(pred_4 obj_04 obj_06)
(pred_4 obj_04 obj_01)
(pred_2 obj_05 obj_02)
(pred_2 obj_09 obj_03)
(pred_2 obj_08 obj_02)
)
(:goal
(and
(pred_2 obj_05 obj_02)
(pred_2 obj_09 obj_02)
(pred_2 obj_08 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_04 ?b obj_01))))
)
)

; plan
1. (op_3 obj_04 obj_09 obj_03 obj_06)
   deleted: (pred_2 obj_09 obj_03) (pred_4 obj_04 obj_06)
   added: (pred_1 obj_04 obj_09 obj_06)
   goals met: 1 of 3
2. (op_1 obj_04 obj_03 obj_02)
   deleted: (pred_3 obj_04 obj_03)
   added: (pred_3 obj_04 obj_02)
   goals met: 1 of 3
3. (op_2 obj_04 obj_09 obj_02 obj_06)
   deleted: (pred_1 obj_04 obj_09 obj_06)
   added: (pred_2 obj_09 obj_02) (pred_4 obj_04 obj_06)
   goals met: 2 of 3
4. (op_3 obj_04 obj_08 obj_02 obj_06)
   deleted: (pred_2 obj_08 obj_02) (pred_4 obj_04 obj_06)
   added: (pred_1 obj_04 obj_08 obj_06)
   goals met: 2 of 3
5. (op_1 obj_04 obj_02 obj_07)
   deleted: (pred_3 obj_04 obj_02)
   added: (pred_3 obj_04 obj_07)
   goals met: 2 of 3
6. (op_2 obj_04 obj_08 obj_07 obj_06)
   deleted: (pred_1 obj_04 obj_08 obj_06)
   added: (pred_2 obj_08 obj_07) (pred_4 obj_04 obj_06)
   goals met: 3 of 3
